
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.Идентификатор) Тогда
		Запись.Идентификатор = Новый УникальныйИдентификатор;
		Элементы.Текст.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.Текст.Доступность = Истина;
		Элементы.Текст.АвтоМаксимальнаяШирина = Ложь;
		Элементы.ГруппаПользователей.Доступность = Истина;
	ИначеЕсли ЗначениеЗаполнено(Запись.Текст) Тогда
		Запись.Текст =
			СтрШаблон(
				"<!DOCTYPE html>
				|	<html>
				|	  <head>
				|	    <meta charset=""UTF-8"">
				|	    <title>Заголовок страницы</title>
				|	  </head>
				|	  <body>
				|	    %1
				|	  </body>
				|	</html>",
				Запись.Текст);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.Автор) Тогда
		Запись.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Запись.ГруппаПользователей = Справочники.ГруппыПользователей.ВсеПользователи Тогда
		Элементы.Ознакомлен.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

