
Процедура пропуск_СправочникПользователиПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Сообщение = пропуск_Логирование.ПустоеСообщение();
	Если Источник.ДополнительныеСвойства.Свойство("пропуск_ОбновлениеИдентификатораПропуска")
		И Источник.ДополнительныеСвойства.пропуск_ОбновлениеИдентификатораПропуска = Истина Тогда
		Сообщение.Текст = "Обновление идентификатора пропуска пользователя " + Источник;
		Сообщение.Тип = Перечисления.пропуск_ТипыСообщений.ОбновлениеИдентификатораПропуска;
	ИначеЕсли ЗначениеЗаполнено(Источник.Ссылка) Тогда
		Сообщение.Текст = "Изменен пользователь " + Источник;
		Сообщение.Тип = Перечисления.пропуск_ТипыСообщений.СозданиеПользователя;
	Иначе
		Сообщение.Текст = "Создан пользователь " + Источник;
		Сообщение.Тип = Перечисления.пропуск_ТипыСообщений.ИзменениеПользователя;
	КонецЕсли;
	
	Сообщение.Контекст = ОбъектВXML(Источник);
	
	пропуск_Логирование.ЗаписатьЛог(Сообщение);
	
КонецПроцедуры

Функция ОбъектВXML(Объект) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписатьXML(ЗаписьXML, Объект);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции
