
Функция СгенерироватьИдентификаторПропускаПользователя(Пользователь) Экспорт
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "Недействителен") = Истина Тогда
		Возврат "";
	КонецЕсли;
	
	ИдентификаторПропуска = СгенерироватьИдентификаторПропуска();
	
	Объект = Пользователь.ПолучитьОбъект();
	Объект.пропуск_ИдентификаторПропуска = ИдентификаторПропуска;
	Объект.ДополнительныеСвойства.Вставить("пропуск_ОбновлениеИдентификатораПропуска", Истина);
	Объект.Записать();
	
	//Логирование+
	Сообщение = пропуск_Логирование.ПустоеСообщение();
	Сообщение.Тип = Перечисления.пропуск_ТипыСообщений.ОбновлениеИдентификатораПропуска;
	Сообщение.Текст =
		СтрШаблон(
			"Сгенерирован идентификатор пропуска для %1: %2",
			Пользователь,
			ИдентификаторПропуска);
	Сообщение.Контекст = Пользователь;
	пропуск_Логирование.ЗаписатьЛог(Сообщение);
	//Логирование-
	
	Возврат ИдентификаторПропуска;
	
КонецФункции

Функция СгенерироватьИдентификаторПропуска()
	
	Возврат СтрЗаменить(Строка(ТекущаяУниверсальнаяДатаВМиллисекундах()), Символы.НПП, "");
	
КонецФункции