
Процедура ЗаписатьЛог(Сообщение) Экспорт
	
	Набор = РегистрыСведений.пропуск_ЖурналЛогирования.СоздатьНаборЗаписей();
	Набор.Отбор.Период.Установить(Сообщение.Дата);
	
	Запись = Набор.Добавить();
	Запись.Период = Сообщение.Дата;
	ЗаполнитьЗначенияСвойств(Запись, Сообщение, , "Контекст");
	
	Запись.Контекст = Новый ХранилищеЗначения(Сообщение.Контекст, Новый СжатиеДанных(9));
	
	Набор.Записать();
	
КонецПроцедуры

Функция ПустоеСообщение() Экспорт
	
	Сообщение = Новый Структура;
	
	// Заполняемые автоматически:
	Сообщение.Вставить("Дата", ТекущаяДата());
	Сообщение.Вставить("Идентификатор", Новый УникальныйИдентификатор);
	
	// Заполняемые в коде:
	Сообщение.Вставить("Тип", Перечисления.пропуск_ТипыСообщений.ПустаяСсылка());
	Сообщение.Вставить("Текст", "");
	Сообщение.Вставить("Автор", Пользователи.ТекущийПользователь());
	Сообщение.Вставить("Контекст", Неопределено);
	
	Возврат Сообщение;
	
КонецФункции

