
#Область ПрограммныйИнтерфейс

Процедура ОткрытьТурникет(ИдентификаторПропуска = Неопределено) Экспорт
	
	Если пропуск_РаботаСКонтролллеромТурникетаВызовСервера.ОткрытьТурникет() Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Турникет открыт");
		
		Если НЕ ИдентификаторПропуска = Неопределено Тогда
			пропуск_РаботаСКонтролллеромТурникетаВызовСервера.ОтразитьОткрытиеТурникетаПоСотруднику(ИдентификаторПропуска);
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Ошибка при открытии турникета! "
			+ "Срочно сформируйте сообщение администратору об ошибке.");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
