
#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура КомандаОткрытьТурникет(Команда)
	
	пропуск_РаботаСКонтролллеромТурникетаКлиент.ОткрытьТурникет();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьТурникетСотруднику(Команда)
	
	ТекущиеДанные = Элементы.СписокСотрудников.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сотрудник в таблице не выбран!");
		
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.пропуск_ИдентификаторПропуска) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон("Не указан идентификатор пропуска сотрудника %1!", ТекущиеДанные.Ссылка));
		
		Возврат;
		
	КонецЕсли;
	
	пропуск_РаботаСКонтролллеромТурникетаКлиент.ОткрытьТурникет(ТекущиеДанные.пропуск_ИдентификаторПропуска);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокСотрудниковПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйИнтерфейс

#КонецОбласти
