
#Область ПрограммныйИнтерфейс

Функция ОткрытьТурникет() Экспорт
	
	Попытка
		Контроллер = ПодключитьКонтроллер();
	Исключение
		Контроллер = Неопределено;
	КонецПопытки;
	
	Если Контроллер = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Состояние = "";
	
	//TODO:
	// Необходимо добавить механизм запроса компоненты котроллера.
	//Если Контроллер.Открыть(Состояние) = Истина Тогда
	Если Истина Тогда
		Возврат Истина;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(Состояние);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПодключитьКонтроллер()
	
	Контроллер = ПолучитьОбщийМакет("пропуск_Контроллер");
	
	//TODO:
	// Необходимо добавить механизм подключения компоненты котроллера.
	
	Возврат Контроллер;
	
КонецФункции

#КонецОбласти

