
#Область ПрограммныйИнтерфейс

Функция ОткрытьТурникет() Экспорт
	
	Попытка
		Контроллер = ПодключитьКонтроллер();
	Исключение
		Контроллер = Неопределено;
	КонецПопытки;
	
	Если Контроллер = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Состояние = "";
	
	//TODO:
	// Необходимо добавить механизм запроса компоненты котроллера.
	//Если Контроллер.Открыть(Состояние) = Истина Тогда
	Если Истина Тогда
		Возврат Истина;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(Состояние);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПодключитьКонтроллер()
	
	Контроллер = ПолучитьОбщийМакет("пропуск_Контроллер");
	
	//TODO:
	// Необходимо добавить механизм подключения компоненты котроллера.
	
	Возврат Контроллер;
	
КонецФункции

Процедура ОтразитьОткрытиеТурникетаПоСотруднику(Сотрудник = Неопределено, ИдентификаторПропуска = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Сотрудник = Неопределено И ИдентификаторПропуска = Неопределено Тогда
		
		Возврат;
		
	ИначеЕсли Сотрудник = Неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("пропуск_ИдентификаторПропуска", ИдентификаторПропуска);
		Выборка = Справочники.Пользователи.Выбрать(,, Отбор);
		
		Если Выборка.Следующий() Тогда
			Сотрудник = Выборка.Ссылка;
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Сотрудник", Сотрудник);
	ПараметрыЗаписи.Вставить("ИдентификаторПропуска", ИдентификаторПропуска);
	ПараметрыЗаписи.Вставить("Вход", Истина);
	
	ЗаписатьВЖурналПосещений(ПараметрыЗаписи);
	
КонецПроцедуры

Процедура ЗаписатьВЖурналПосещений(ПараметрыЗаписи) Экспорт
	
	ТекущаяДата = ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.пропуск_ЖурналПосещений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ТекущаяДата;
	Запись.Сотрудник = ПараметрыЗаписи.Сотрудник;
	Запись.ИдентификаторПропуска = ПараметрыЗаписи.ИдентификаторПропуска;
	Запись.Вход = ПараметрыЗаписи.Вход;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйИнтерфейс

#КонецОбласти

