
#Область ПрограммныйИнтерфейс

Функция ОткрытьТурникет() Экспорт
	
	Попытка
		Контроллер = ПодключитьКонтроллер();
	Исключение
		Контроллер = Неопределено;
	КонецПопытки;
	
	Если Контроллер = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Состояние = "";
	
	//TODO:
	// Необходимо добавить механизм запроса компоненты котроллера.
	//Если Контроллер.Открыть(Состояние) = Истина Тогда
	Если Истина Тогда
		Возврат Истина;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(Состояние);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПодключитьКонтроллер()
	
	Контроллер = ПолучитьОбщийМакет("пропуск_Контроллер");
	
	//TODO:
	// Необходимо добавить механизм подключения компоненты котроллера.
	
	Возврат Контроллер;
	
КонецФункции

Процедура ОтразитьОткрытиеТурникетаПоСотруднику(Сотрудник = Неопределено, ИдентификаторПропуска = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийСотрудник = Справочники.Пользователи.ПустаяСсылка();
	
	Если Сотрудник = Неопределено И НЕ ИдентификаторПропуска = Неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("пропуск_ИдентификаторПропуска", ИдентификаторПропуска);
		Выборка = Справочники.Пользователи.Выбрать(,, Отбор);
		
		Если Выборка.Следующий() Тогда
			ТекущийСотрудник = Выборка.Ссылка;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Сотрудник) Тогда
		
		ТекущийСотрудник = Сотрудник;
		
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Сотрудник", ТекущийСотрудник);
	ПараметрыЗаписи.Вставить("ИдентификаторПропуска", ИдентификаторПропуска);
	ПараметрыЗаписи.Вставить("Вход", Истина);
	
	ЗаписатьВЖурналПосещений(ПараметрыЗаписи);
	
КонецПроцедуры

Процедура ЗаписатьВЖурналПосещений(ПараметрыЗаписи) Экспорт
	
	ТекущаяДата = ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.пропуск_ЖурналПосещений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ТекущаяДата;
	Запись.Сотрудник = ПараметрыЗаписи.Сотрудник;
	Запись.ИдентификаторПропуска = ПараметрыЗаписи.ИдентификаторПропуска;
	Запись.Вход = ПараметрыЗаписи.Вход;
	
	НаборЗаписей.Записать();
	
	// Логирование++
	
	Сообщение = пропуск_Логирование.ПустоеСообщение();
	
	Если ЗначениеЗаполнено(ПараметрыЗаписи.Сотрудник) Тогда
		Сообщение.Тип = Перечисления.пропуск_ТипыСообщений.ОткрытиеТурникетаСотруднику;
		Сообщение.Текст =
			СтрШаблон(
				"Открытие турникета для %1: %2",
				ПараметрыЗаписи.Сотрудник,
				ПараметрыЗаписи.ИдентификаторПропуска);
		Сообщение.Контекст = ПараметрыЗаписи.Сотрудник;
	Иначе
		Сообщение.Тип = Перечисления.пропуск_ТипыСообщений.ОткрытиеТурникета;
		Сообщение.Текст = "Открытие турникета";
	КонецЕсли;
	
	пропуск_Логирование.ЗаписатьЛог(Сообщение);
	
	// Логирование--
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйИнтерфейс

#КонецОбласти

