
Функция ПолучитьВремяПоследнегоВходаПользователя(ИдентификаторПропуска) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторПропуска", ИдентификаторПропуска);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	пропуск_ЖурналПосещенийСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.пропуск_ЖурналПосещений.СрезПоследних(, ИдентификаторПропуска = &ИдентификаторПропуска) КАК пропуск_ЖурналПосещенийСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Период;
	Иначе
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
КонецФункции