
#Область ПрограммныйИнтерфейс

Функция ОткрытьТурникет(ИдентификаторПропуска) Экспорт
	
	Отказ = Ложь;
	
	Если ЗначениеЗаполнено(ИдентификаторПропуска) Тогда
		
		Отказ = НЕ пропуск_РаботаСКонтролллеромТурникетаВызовСервера.ОтразитьОткрытиеТурникетаПоСотруднику(, ИдентификаторПропуска);
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Отказ = пропуск_РаботаСКонтролллеромТурникетаВызовСервера.ОткрытьТурникет();
		
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

#КонецОбласти

#Область СлужебныйИнтерфейс

Процедура СообщитьОбИнциденте(Тип, КонтекстСтрокой = "") Экспорт
	
	пропуск_РаботаСКонтролллеромТурникетаВызовСервера.СообщитьОбИнциденте(Тип, КонтекстСтрокой);
	
КонецПроцедуры

#КонецОбласти
